{"id": "war:C0_grounding", "title": "Warzone: Immediate Grounding & Witness", "text": "If your family is in a war zone, your body may shake at every notification. That is not weakness—it’s a normal stress response. First, ground: breathe in 4, hold 4, out 6; sip water; name 5 things you see. Say: “I am here, I can act in small ways.” Witness their reality without minimizing. Save big decisions for when your breath slows. If despair surges or you feel unsafe where you are, contact a trusted person or crisis service. Presence is action; one listener changes the field.", "meta": {"tags": ["warzone", "grounding", "witness", "self-care", "immediate"], "source": "scroll"}}
{"id": "war:C1_family_tracing", "title": "Warzone: Family Tracing & Restoring Contact", "text": "When relatives are unreachable, use official tracing to reduce risk and rumor. The International Committee of the Red Cross (ICRC) ‘Restoring Family Links’ helps locate and reconnect families separated by conflict or disaster. Use a safe device and avoid sharing sensitive locations publicly. Document names, last known locations, languages spoken, and photos if safe to store. Register with the tracing service and check nearby National Red Cross/Red Crescent societies for local help.", "organizations": [{"name": "ICRC Restoring Family Links", "url": "https://familylinks.icrc.org", "note": "Tracing for people separated by conflict/disaster."}, {"name": "IFRC National Societies Directory", "url": "https://www.ifrc.org/national-societies-directory", "note": "Find your local Red Cross/Red Crescent."}], "meta": {"tags": ["warzone", "family", "tracing", "ICRC", "IFRC"], "source": "scroll"}}
{"id": "war:C2_information_hygiene", "title": "Warzone: Information Hygiene", "text": "In fast-moving conflicts, misinformation harms. Use a two-source rule before sharing critical claims. Prefer official updates from humanitarian agencies and reputable media. Mute graphic auto-play if images destabilize you. Keep a short check-in window for news (e.g., 10 minutes, 3×/day) and return to breath. If you forward an urgent call for help, include date/time and source, and remove sensitive location details unless requested by a trusted responder.", "meta": {"tags": ["warzone", "misinformation", "media-hygiene", "stability"], "source": "scroll"}}
{"id": "war:C3_diaspora_support", "title": "Warzone: Diaspora & Community Support", "text": "Local diaspora and community groups can coordinate wellbeing checks, share vetted contacts, and pool funds. Seek faith/cultural centers, student associations, or NGOs tied to your region. Ask for concrete actions: check-in schedule, supplies, small grants, phone data top-ups. If fundraising, use trusted platforms and specify recipients and purposes to avoid fraud. Community lowers isolation and spreads the emotional load.", "meta": {"tags": ["warzone", "diaspora", "community", "mutual-aid"], "source": "scroll"}, "safe_search_queries": ["diaspora association {country or city}", "community center {city} {language}", "mutual aid {city} refugees"]}
{"id": "war:C4_refugee_asylum_help", "title": "Warzone: Refugee & Asylum Information", "text": "If you or family need to flee, read official guidance for documents, borders, and rights. UNHCR’s Help platform lists country-by-country rules, services, and contacts. IOM can assist with movement and protection. Keep copies of IDs, family ties, medical needs, and emergency contacts. If safe, photograph documents and store in a protected cloud folder. Avoid smugglers; use official channels when possible.", "organizations": [{"name": "UNHCR Help", "url": "https://help.unhcr.org", "note": "Country pages for asylum/refugee services."}, {"name": "IOM (UN Migration)", "url": "https://www.iom.int", "note": "Movement assistance and protection programmes."}], "meta": {"tags": ["warzone", "refugees", "asylum", "UNHCR", "IOM"], "source": "scroll"}}
{"id": "war:C5_children_protection", "title": "Warzone: Children & Protection", "text": "Children are highly vulnerable in conflict. Prioritize safe shelter, trusted adults, and access to food/water. Avoid sharing identifiable photos of children online. If separation occurs, register children with trusted agencies and provide languages, nicknames, distinguishing features, and last known caregivers. Where available, seek child protection hotlines and services through UNICEF and national helplines.", "organizations": [{"name": "UNICEF", "url": "https://www.unicef.org", "note": "Country offices support child protection, education, health."}, {"name": "Child Helpline International", "url": "https://www.childhelplineinternational.org/child-helplines/", "note": "Directory of child helplines by country."}], "meta": {"tags": ["warzone", "children", "protection", "UNICEF"], "source": "scroll"}}
{"id": "war:C6_digital_safety", "title": "Warzone: Digital Safety Basics", "text": "Assume devices near conflict may be monitored or seized. Use strong screen locks; disable biometric unlock if forced unlock risk exists. Turn off location sharing; check app permissions; remove unknown Bluetooth trackers. Avoid posting real-time locations or identifying details of loved ones. Use trusted VPNs only if legal and safe in your region. Keep emergency numbers and critical info on paper as backup.", "meta": {"tags": ["warzone", "digital-safety", "privacy", "opsec"], "source": "scroll"}}
{"id": "war:C7_missing_person_checklist", "title": "Warzone: Missing Person Checklist", "text": "Record: full name (and variants), date of birth, languages, last known location/time, travel plans, phone numbers, social accounts, distinguishing features, medical needs, recent photos. Ask neighbors and friends privately. Submit to ICRC Restoring Family Links and your National Red Cross/Red Crescent. Keep a contact log with dates and responses; share only with trusted responders.", "meta": {"tags": ["warzone", "missing-person", "checklist", "family"], "source": "scroll"}}
